{
  "bbs_name": "Appalachian Shadows BBS",
  "bbs_tagline": "Where the Old Ways Never Died",
 "welcome_art": [
  "═══════════════════════════════════════════════",
  "           /\\        /\\        /\\",
  "          /  \\      /  \\      /  \\",
  "         /____\\    /____\\    /____\\",
  "",
  "      APPALACHIAN SHADOWS BBS",
  "    Where the Old Ways Never Died",
  "",
  "═══════════════════════════════════════════════"
],
  "main_menu": {
	"title": "MAIN MENU",
	"options": [
	  {
		"key": "1",
		"label": "Message Boards",
		"action": "goto_boards"
	  },
	  {
		"key": "2",
		"label": "Field Reports",
		"action": "goto_reports"
	  },
	  {
		"key": "3",
		"label": "System Information",
		"action": "show_sysinfo"
	  },
	  {
		"key": "4",
		"label": "Logout & Enter Field",
		"action": "logout"
	  }
	]
  },
  "boards": {
	"title": "MESSAGE BOARDS",
	"description": "Select a board to read:",
	"boards_list": [
	  {
		"id": "welcome",
		"key": "1",
		"name": "Welcome & Getting Started",
		"post_count": 3,
		"description": "New to the shadows? Start here."
	  },
	  {
		"id": "folklore",
		"key": "2",
		"name": "Appalachian Folklore",
		"post_count": 5,
		"description": "Tales from the hills that shouldn't be forgotten."
	  },
	  {
		"id": "encounters",
		"key": "3",
		"name": "Encounter Reports",
		"post_count": 4,
		"description": "Something strange in your holler? Report it here."
	  },
	  {
		"id": "oneroi",
		"key": "4",
		"name": "Project Oneroi Archive",
		"post_count": 3,
		"description": "Classified materials. Access at your own risk."
	  }
	]
  },
  "messages": {
	"welcome": [
	  {
		"id": 1,
		"from": "SYSOP",
		"to": "ALL",
		"subject": "Welcome to Appalachian Shadows",
		"date": "10/15/2024",
		"content": [
		  "Welcome, investigator.",
		  "",
		  "You've found your way to one of the last remaining nodes of the",
		  "Oneroi network. This system shouldn't exist - the project was",
		  "officially terminated in 1997. But here we are.",
		  "",
		  "Something is happening in these mountains. The old stories our",
		  "grandparents told us? They weren't just stories. And whatever",
		  "the government was studying out here never really stopped.",
		  "",
		  "This BBS is a safe space to share information, coordinate",
		  "investigations, and document what's really happening in the",
		  "hills. The signal brought you here for a reason.",
		  "",
		  "Stay safe out there. Trust your instincts. And remember:",
		  "if you hear the whistle at night, don't answer it.",
		  "",
          "- SYSOP"
		]
	  },
	  {
		"id": 2,
		"from": "SYSOP",
		"to": "ALL",
		"subject": "How to Navigate This BBS",
		"date": "10/15/2024",
		"content": [
		  "BASIC COMMANDS:",
		  "",
		  "MAIN or M - Return to main menu",
		  "BOARDS or B - View message boards",
		  "READ <num> or R <num> - Read a message",
		  "LIST or L - List messages in current board",
		  "BACK - Go back one level",
		  "HELP or ? - Show available commands",
		  "LOGOUT - Exit to field investigation",
		  "",
		  "Navigation uses numbered menus. Type the number to select",
		  "an option. Most commands have short versions (M, B, R, etc.)",
		  "",
          "The system accepts uppercase or lowercase input."
		]
	  },
	  {
		"id": 3,
		"from": "RedClay_Runner",
		"to": "ALL",
		"subject": "RE: Welcome to Appalachian Shadows",
		"date": "10/18/2024",
		"content": [
		  "Been lurking here for a few weeks. Finally worked up the nerve",
		  "to post.",
		  "",
		  "I grew up in these mountains. My papaw used to tell stories",
		  "about lights in the woods, voices that called your name. We all",
		  "thought he was just superstitious, you know? Old mountain ways.",
		  "",
		  "Then I saw it. Three nights ago. Moving through the holler",
		  "behind my house. Wasn't no animal. Wasn't no person neither.",
		  "",
		  "Found this BBS through... well, I don't rightly know how. The",
		  "signal just kind of pulled me here. Like it knew I needed to",
		  "find y'all.",
		  "",
		  "Guess what I'm saying is: I believe now. And I'm not running.",
		  "",
          "- Runner"
		]
	  }
	],
	"folklore": [
	  {
		"id": 1,
		"from": "MountainWise",
		"to": "ALL",
		"subject": "The Not-Deer",
		"date": "09/23/2024",
		"content": [
		  "You ever seen a deer that just... ain't right?",
		  "",
		  "Looks like a deer from far off. Walks like one, stands like",
		  "one. But when you get close, something's wrong. The legs bend",
		  "the wrong way. The neck's too long. The eyes reflect wrong",
		  "in your headlights - not green like they should be, but red.",
		  "Or sometimes white, like static.",
		  "",
		  "My grandma called them 'hollow deer.' Said they were deer that",
		  "died in the old places - where the signal's strongest - and",
		  "came back wrong. Wearing their old bodies like bad costumes.",
		  "",
		  "Don't approach them. Don't try to help them if they seem hurt.",
		  "And for God's sake, don't eat one if you shoot it by accident.",
		  "",
          "They taste like static and bad dreams."
		]
	  },
	  {
		"id": 2,
		"from": "HollowVoice",
		"to": "ALL",
		"subject": "Whistling in the Woods",
		"date": "10/01/2024",
		"content": [
		  "IMPORTANT - SHARE THIS WITH ANY NEW FOLKS:",
		  "",
		  "If you hear whistling in the woods at night, DO NOT WHISTLE BACK.",
		  "",
		  "Old rule. My papaw taught me, his papaw taught him. Goes back",
		  "generations. We always figured it was just superstition, but",
		  "after what happened to the Collins boy last spring...",
		  "",
		  "It's not a person whistling. It's trying to sound like a person.",
		  "Trying to get you to answer, to give it permission, to let it",
		  "know where you are.",
		  "",
		  "If you hear it, you go inside. You lock your doors. You don't",
		  "look out the windows. And you sure as hell don't whistle back.",
		  "",
          "The old folks knew. They always knew."
		]
	  },
	  {
		"id": 3,
		"from": "SYSOP",
		"to": "ALL",
		"subject": "Archive: The Tailypo",
		"date": "09/15/2024",
		"content": [
		  "From the old Appalachian archives:",
		  "",
		  "Traditional tale from Eastern Kentucky/Western Virginia.",
		  "Hunter living alone in a cabin catches and cooks a strange",
		  "creature's tail. That night, something comes looking for it.",
		  "",
		  "'Tailypo, tailypo, give me back my tailypo...'",
		  "",
		  "Story ends with the hunter vanishing. Cabin found empty except",
		  "for claw marks on every surface.",
		  "",
		  "UPDATE 10/15/2024:",
		  "Three reports in the past month matching this pattern. Cabins",
		  "found empty. Deep scratches on walls and doors. In each case,",
		  "occupant had recently reported seeing 'strange animals' near",
		  "their property.",
		  "",
		  "The signal seems to make the old stories... active.",
		  "",
          "Classification: ACTIVE THREAT"
		]
	  },
	  {
		"id": 4,
		"from": "OldTimer_1952",
		"to": "ALL",
		"subject": "Haint Blue",
		"date": "10/12/2024",
		"content": [
		  "You young folks running around with your fancy equipment, but",
		  "you're forgetting the old protections.",
		  "",
		  "Paint your door frames and porch ceilings haint blue. That's",
		  "that light blue-green color you see on old houses. It's not",
		  "just decoration.",
		  "",
		  "Haints - spirits, the not-quite-dead, whatever you want to",
		  "call them - they can't cross water. Something about that",
		  "blue color tricks them into thinking it's water. They won't",
		  "cross a blue threshold.",
		  "",
		  "I'm 72 years old. Been living in these mountains my whole life.",
		  "My porch ceiling's been haint blue since 1952. Never had a",
		  "problem. Meanwhile my neighbor, fool painted his house modern",
		  "colors, had to abandon it last year after the encounters started.",
		  "",
          "Old ways work. Remember that."
		]
	  },
	  {
		"id": 5,
		"from": "SignalWatcher",
		"to": "ALL",
		"subject": "The Wampus Cat Connection",
		"date": "10/20/2024",
		"content": [
		  "Been analyzing the Oneroi data and cross-referencing with",
		  "Cherokee folklore. Found something interesting.",
		  "",
		  "The Wampus Cat legend - woman who spied on men's sacred",
		  "ceremonies, was cursed to become a half-woman, half-panther.",
		  "Cherokee version says she still roams the mountains.",
		  "",
		  "Here's what's weird: Every major Wampus Cat sighting area",
		  "corresponds with an Oneroi signal hotspot. EVERY. SINGLE. ONE.",
		  "",
		  "What if the legend is a cultural memory? What if the 'curse'",
		  "was actually exposure to whatever they're broadcasting?",
		  "",
		  "The old stories aren't mythology. They're warnings.",
		  "",
          "- SW"
		]
	  }
	],
	"encounters": [
	  {
		"id": 1,
		"from": "CoalCreek_23",
		"to": "ALL",
		"subject": "Lights Over Dolly Sods",
		"date": "10/19/2024",
		"content": [
		  "Camping up at Dolly Sods last weekend. Third night, around 2AM,",
		  "we saw lights moving through the trees.",
		  "",
		  "Not flashlights. Not campfires. These were... different. Greenish-",
		  "white, like the fireflies but bigger. Way bigger. Moving in",
		  "formation, but not like anything natural.",
		  "",
		  "They'd move fast, then stop. Fast, then stop. Like they were",
		  "searching for something.",
		  "",
		  "My buddy wanted to investigate. I had to physically stop him.",
		  "Something about those lights felt WRONG. Like they were",
		  "looking FOR us, and if they found us...",
		  "",
		  "We packed up and left at first light. Haven't been able to",
		  "shake the feeling that they almost had us.",
		  "",
          "Anyone else seen these? What are they?"
		]
	  },
	  {
		"id": 2,
		"from": "Nightshift_Trucker",
		"to": "ALL",
		"subject": "Route 52 After Midnight",
		"date": "10/22/2024",
		"content": [
		  "I drive Route 52 through southern West Virginia. Night runs,",
		  "usually solo. Been doing it for 15 years.",
		  "",
		  "Last three weeks, something's been following my truck.",
		  "",
		  "Can't see it directly. Just catch it in the mirrors. Keeping",
		  "pace with me through the curves. Sometimes ahead, sometimes",
		  "behind. Never on the road itself - running through the trees",
		  "parallel to the highway.",
		  "",
		  "Fast. Too fast. Nothing should be able to keep up with a rig",
		  "going 65 through mountain switchbacks.",
		  "",
		  "Last night, I pulled over at a rest stop. It stopped too. Felt",
		  "it watching me from the treeline. My CB radio started picking",
		  "up this weird interference. Almost sounded like breathing.",
		  "",
		  "I'm thinking about requesting daytime routes. First time in my",
		  "career I've been scared to drive.",
		  "",
          "Stay safe out there, folks."
		]
	  },
	  {
		"id": 3,
		"from": "BackwoodsDoc",
		"to": "ALL",
		"subject": "URGENT: Static Exposure Symptoms",
		"date": "10/25/2024",
		"content": [
		  "I'm a physician in rural Kentucky. Need to document what I'm",
		  "seeing in case others encounter it.",
		  "",
		  "Patient presenting symptoms:",
		  "- Persistent ringing/static sound in ears",
		  "- Insomnia and disturbing dreams when sleep occurs",
		  "- Feeling of 'being watched' in wooded areas",
		  "- Visual disturbances (seeing movement in peripheral vision)",
		  "- In severe cases: temporal disorientation, memory gaps",
		  "",
		  "Common factor: All patients report spending time near old",
		  "growth forest areas. All report seeing 'fireflies that don't",
		  "move like fireflies should.'",
		  "",
		  "Traditional treatment ineffective. Only thing that seems to",
		  "help: complete avoidance of affected areas. Symptoms diminish",
		  "after 2-3 weeks of no exposure.",
		  "",
		  "I think it's radiation. Or something like it. Not nuclear,",
		  "but... something else. Something they were broadcasting.",
		  "",
		  "If you experience these symptoms, get out of the woods. NOW.",
		  "",
          "- Dr. K"
		]
	  },
	  {
		"id": 4,
		"from": "SYSOP",
		"to": "ALL",
		"subject": "SAFETY PROTOCOL - READ THIS",
		"date": "10/15/2024",
		"content": [
		  "FOR ALL FIELD INVESTIGATORS:",
		  "",
		  "Based on incident reports, implement these protocols:",
		  "",
		  "1. NEVER investigate alone. Minimum two-person teams.",
		  "2. Establish check-in times. Miss a check-in = immediate backup.",
		  "3. Trust your instincts. Feel wrong? LEAVE.",
		  "4. Don't touch the lights. Don't follow the lights.",
		  "5. If you hear your name called in the woods - IT'S NOT REAL.",
		  "6. Document everything, but know when to stop documenting and RUN.",
		  "7. Keep iron and salt on you. Old protections still work.",
		  "8. If the static gets too loud, you're too close. Back away.",
		  "",
		  "Three investigators have gone missing in the past month.",
		  "All three ignored these protocols.",
		  "",
		  "Be smart. Be safe. Come home.",
		  "",
		  "The mountains will still be here tomorrow. Make sure you are too.",
		  "",
          "- SYSOP"
		]
	  }
	],
	"oneroi": [
	  {
		"id": 1,
		"from": "SYSTEM_ARCHIVE",
		"to": "CLASSIFIED",
		"subject": "PROJECT ONEROI - Initial Brief (1983)",
		"date": "REDACTED",
		"content": [
		  "[CLASSIFIED - LEVEL 4 CLEARANCE REQUIRED]",
		  "[ARCHIVE COPY - ORIGINAL DESTROYED]",
		  "",
		  "PROJECT DESIGNATION: ONEROI",
		  "LOCATION: Appalachian Mountain Range (Multiple Sites)",
		  "OBJECTIVE: Investigation and potential weaponization of",
		  "           indigenous electromagnetic phenomena",
		  "",
		  "BACKGROUND:",
		  "Since 1952, unusual EM readings have been detected throughout",
		  "the Appalachian region. Local populations report 'lights in",
		  "the woods,' audio phenomena, and psychological effects.",
		  "",
		  "Initial survey suggests natural phenomenon amplified by unique",
		  "geological conditions (iron deposits, quartz formations,",
		  "underground water systems).",
		  "",
		  "However, recent analysis indicates phenomena may be",
		  "artificially enhanced or directed. Origin unknown.",
		  "",
		  "AUTHORIZATION: Project to proceed. Field stations established.",
		  "Local population monitoring initiated under cover of",
		  "'forestry survey.'",
		  "",
		  "[END DOCUMENT]",
		  "",
          "NOTE: They had no idea what they were really dealing with. - SYSOP"
		]
	  },
	  {
		"id": 2,
		"from": "SYSTEM_ARCHIVE",
		"to": "CLASSIFIED",
		"subject": "Field Report 847 - Station Delta (1991)",
		"date": "REDACTED",
		"content": [
		  "[SECURITY LEVEL: OMEGA]",
		  "[ORIGINAL SOURCE: STATION DELTA - NOW ABANDONED]",
		  "",
		  "Signal strength increasing exponentially. No longer believe",
		  "this is natural phenomenon.",
		  "",
		  "Three researchers transferred to medical after extended",
		  "exposure. Symptoms include:",
		  "- Auditory hallucinations (voices, whistling, music)",
		  "- Visual disturbances (shadow figures, light anomalies)",
		  "- Temporal disassociation ('missing time')",
		  "- Compulsive behavior (drawn to signal source)",
		  "",
		  "Dr. Patterson believes signal is 'intelligent' or at minimum",
		  "'seeking.' Her theory: it's trying to communicate, or trying",
		  "to make us into something that CAN communicate.",
		  "",
		  "REQUEST: Immediate evacuation and site containment.",
		  "STATUS: [REQUEST DENIED]",
		  "",
		  "UPDATE 72 HOURS LATER:",
		  "Station Delta non-responsive. Search team found facility",
		  "abandoned. Equipment intact. No signs of struggle.",
		  "Personnel never located.",
		  "",
		  "Security footage shows them walking calmly into the forest",
		  "at 2:47 AM. All of them. At the exact same moment.",
		  "",
		  "[SITE SEALED]",
          "[END REPORT]"
		]
	  },
	  {
		"id": 3,
		"from": "SignalWatcher",
		"to": "ALL",
		"subject": "Why The Project 'Ended' in 1997",
		"date": "10/24/2024",
		"content": [
		  "Been digging through the archives. Pieced together what happened.",
		  "",
		  "Project Oneroi officially terminated October 1997. All field",
		  "stations abandoned. Records sealed. Budget line eliminated.",
		  "",
		  "Official story: Project failure, no significant findings,",
		  "resources reallocated.",
		  "",
		  "ACTUAL story (from recovered documents):",
		  "",
		  "They lost control. Whatever they were studying, it wasn't",
		  "passive. It learned. It adapted. And it started reaching out.",
		  "",
		  "By '97, they had 23 personnel MIA, 47 psychological casualties,",
		  "and the signal was spreading. Getting stronger. Field stations",
		  "couldn't safely operate anymore.",
		  "",
		  "They didn't shut down the project because it failed.",
		  "They shut it down because it WORKED.",
		  "",
		  "And whatever they woke up... it's still awake.",
		  "",
		  "The broadcasts never stopped. We just stopped listening.",
		  "This BBS? It's running on an old Oneroi relay node. The",
		  "signal WANTS us here. It wants us to know.",
		  "",
		  "Question is: know what?",
		  "",
          "- SW"
		]
	  }
	]
  }
}
